common/models/system/Setting.php

    public function batchSave(array $post)
    {
        foreach ($post as $key=>$value) {
            $model = (new Setting)->findOne(['key'=>$key]);
            if($model) {
                $model->setAttribute('value', $value);
                if($model->getOldAttribute('value') != $model->getAttribute('value')) {
                    $model->save(false);//不验证保存
---
UPDATE `t_setting` SET `value`='土人内容管理系统' WHERE `id`='634'

    public function updateCache()
    {
        $cache = Yii::$app->getCache();
        $models = Setting::find()->all();//整个缓存表，包括不可见内容
---
SELECT * FROM `t_setting`