common/models/user/User.php

SELECT * FROM `t_user` WHERE (`id`=30) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => 1]);

SELECT * FROM `t_user` WHERE (`username`='jorry') AND (`status`=1)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => 1]);