backend/modules/system/controllers/ConfigController.php

SELECT * FROM `t_setting` WHERE `is_visible`=1
---
    public function actionConfig()
    {
        if (Yii::$app->request->post()) {
            $model = new Setting;
            if ($model->batchSave(Yii::$app->request->post()[$model->formName()]) && $model->updateCache()) {
                Yii::$app->getSession()->setFlash('success', Yii::t('system', 'Save Config Success!'));
                return $this->redirect(['config']);
            }
        } else {
            $models = Setting::find()->where(['is_visible'=>Setting::SETTING_ACTIVE])->all();